#(1) a列表包含250个电影的播放时长，通过直方图展示不同时长段包含的电影有多少个

from  matplotlib import pyplot as plt
from matplotlib import font_manager

a=[131,  98, 125, 131, 124, 139, 131, 117, 128, 108, 135, 138, 131, 102, 107, 114, 119, 128, 121, 142, 127, 130, 124, 101, 110, 116, 117, 110, 128, 128, 115,  99, 136, 126, 134,  95, 138, 117, 111,78, 132, 124, 113, 150, 110, 117,  86,  95, 144, 105, 126, 130,126, 130, 126, 116, 123, 106, 112, 138, 123,  86, 101,  99, 136,123, 117, 119, 105, 137, 123, 128, 125, 104, 109, 134, 125, 127,105, 120, 107, 129, 116, 108, 132, 103, 136, 118, 102, 120, 114,105, 115, 132, 145, 119, 121, 112, 139, 125, 138, 109, 132, 134,156, 106, 117, 127, 144, 139, 139, 119, 140,  83, 110, 102,123,107, 143, 115, 136, 118, 139, 123, 112, 118, 125, 109, 119, 133,112, 114, 122, 109, 106, 123, 116, 131, 127, 115, 118, 112, 135,115, 146, 137, 116, 103, 144,  83, 123, 111, 110, 111, 100, 154,136, 100, 118, 119, 133, 134, 106, 129, 126, 110, 111, 109, 141,120, 117, 106, 149, 122, 122, 110, 118, 127, 121, 114, 125, 126,114, 140, 103, 130, 141, 117, 106, 114, 121, 114, 133, 137,  92,121, 112, 146,  97, 137, 105,  98, 117, 112,  81,  97, 139, 113,134, 106, 144, 110, 137, 137, 111, 104, 117, 100, 111, 101, 110,105, 129, 137, 112, 120, 113, 133, 112,  83,  94, 146, 133, 101,131, 116, 111,  84, 137, 115, 122, 106, 144, 109, 123, 116, 111,111, 133, 150]

# 组数和组距
print(max(a),min(a),max(a)-min(a))
bin_width=5  #组距
bin_nums=(max(a)-min(a))//bin_width
# print(bin_nums)   #15组

plt.hist(a,bin_nums)
plt.show()
plt.xticks(range(min(a),max(a)))

#(2) 条形图转直方图
'''美国人口普查结果发现124百万人在离家相对较远的地方工作，对其上班时间进行抽样统计，得到相关结果：
其中interval为上班时长，width为组距（组距不是固定的，因为上班时间在45分钟往后的人很少，仍以5为组距
进行划分不合理，根据人数改变对应的组距），quantity为不同时间段统计出来的人数，如0~5分钟有836人，5~10
分钟2737人……，quantity并不是原始数据，而是统计后得到的数据，若想利用如下数据得到直方图，
不可以用plt.hist（）方法，而是借用条形图的方式进行转化
'''
interval = [0,5,10,15,20,25,30,35,40,45,60,90]
width = [5,5,5,5,5,5,5,5,5,15,30,60]
quantity = [836,2737,3723,3926,3596,1438,3273,642,824,613,215,47]

# 1、quantity为y轴，确定x轴--做草图
plt.figure(figsize=(20,8),dpi=90)
plt.bar(range(len(quantity)),quantity)

# 2、修改x轴的刻度，使其变成  interval对应的刻度
plt.xticks(interval)